<?php
$region = ['Московская область' => ['Москва', 'Зеленоград', 'Клин'], 
		'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Кронштадт'], 
		'Рязанская область' => ['Рязань', 'Касимов', 'Скопин', 'Сасово', 'Ряжск', 'Рыбное', 'Новомичуринск', 'Кораблино', 'Михайлов', 'Спасск-Рязанский', 'Шацк', 'Спас-Клепики']];
foreach ($region as $key => $value) {
 echo '<b>'.$key.':</b><br>';
	foreach ($value as $key => $value) {
		if(mb_substr($value, 0, 1) == 'К') {
			echo $value;
			if(($value !== 'Клин') and ($value !== 'Кронштадт') and ($value !== 'Кораблино')) {
				echo ', ';
			}
		}
	}
  echo '<br>';
}
unset($value);